tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "coreutils"
brew "asdf", args: ["HEAD"]
brew "bash"
brew "ex-vi"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnutls"
brew "gnupg"
brew "go"
brew "hdf5"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "python@3.10"
brew "lazygit"
brew "lua"
brew "neovim"
brew "nnn"
brew "pipx"
brew "python@3.11"
brew "poetry"
brew "r"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "vifm"
brew "yarn"
brew "zlib"
brew "zsh-autosuggestions"
cask "font-anonymice-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-lekton-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-victor-mono-nerd-font"
cask "mambaforge"
